0x1B-web_stack_debugging_4/ab_output.log
This is ApacheBench, Version 2.3 <$Revision: 1528965 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 200 requests
Completed 400 requests
Completed 600 requests
Completed 800 requests
Completed 1000 requests
Completed 1200 requests
Completed 1400 requests
Completed 1600 requests
Completed 1800 requests
Completed 2000 requests
Finished 2000 requests


Server Software:        nginx/1.4.6
Server Hostname:        localhost
Server Port:            80

Document Path:          /
Document Length:        201 bytes

Concurrency Level:      100
Time taken for tests:   2.739 seconds
Complete requests:      2000
Failed requests:        822
   (Connect: 0, Receive: 0, Length: 822, Exceptions: 0)
Non-2xx responses:      1178
Total transferred:      1138204 bytes
HTML transferred:       739842 bytes
Requests per second:    730.28 [#/sec] (mean)
Time per request:       136.934 [ms] (mean)
Time per request:       1.369 [ms] (mean, across all concurrent requests)
Transfer rate:          405.86 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   2.4      0      95
Processing:     1  134  52.3    103     295
Waiting:        1  134  52.3    103     295
Total:          3  134  52.2    103     295

Percentage of the requests served within a certain time (ms)
  50%    103
  66%    194
  75%    197
  80%    197
  90%    198
  95%    199
  98%    200
  99%    200
 100%    295 (longest request)